{
  "devotionals": {
    "2025-05-01": {
      "title": "A Heart of Gratitude",
      "verse": "Psalm 100:4 - Enter his gates with thanksgiving and his courts with praise; give thanks to him and praise his name.",
      "text": "A heart of gratitude is a doorway to God's presence. Psalm 100:4 invites us to 'enter his gates with thanksgiving and his courts with praise.' When we focus on what God has done for us, our perspective shifts from what we lack to what we have. As women, we often get caught up in the comparison trap, but a heart of gratitude allows us to find joy and contentment in our own journey. What are you grateful for today? Take a moment to thank God for the big and small blessings in your life. Gratitude is a beautiful act of worship that honors God and brings peace to our souls.",
      "category": "daily",
      "topic": "gratitude",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1514782831304-632d84503f6f?w=800"
    },
    "2025-05-02": {
      "title": "Leading with Grace",
      "verse": "1 Peter 4:10 - As each has received a gift, use it to serve one another, as good stewards of God's varied grace.",
      "text": "God has given each of us unique gifts, and with those gifts comes the responsibility to lead with grace. 1 Peter 4:10 reminds us: 'As each has received a gift, use it to serve one another, as good stewards of God's varied grace.' Leadership is not just a position; it's an opportunity to serve others with the grace God has given us. What gift has God given you? It may be a talent, a skill, or a special ability. Use it today to serve others with grace and humility. A woman who leads with grace is a reflection of God's love and a source of strength for those around her.",
      "category": "leadership",
      "topic": "leading-with-grace",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    },
    "2025-05-03": {
      "title": "A Consistent Walk with God",
      "verse": "Psalm 119:105 - Your word is a lamp to my feet and a light to my path.",
      "text": "Our walk with God is a daily journey, and His Word is our guide. Psalm 119:105 says: 'Your word is a lamp to my feet and a light to my path.' In a world full of noise and distractions, God's Word provides clarity and direction. A consistent walk with God requires a consistent habit of spending time in His Word. What decision are you facing today? Turn to God's Word for guidance and direction. His truth will light your path and give you the wisdom you need to make the right choices. A consistent walk with God is a path to a life full of purpose and peace.",
      "category": "faith",
      "topic": "consistent-walk",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    },
    "2025-05-04": {
      "title": "The Strength of Quietness",
      "verse": "Isaiah 30:15 - For thus said the Lord God, the Holy One of Israel, “In returning and rest you shall be saved; in quietness and in trust shall be your strength.”",
      "text": "In a world that values busyness and noise, God calls us to find strength in quietness. Isaiah 30:15 tells us: 'In returning and rest you shall be saved; in quietness and in trust shall be your strength.' As women, we often feel the pressure to do it all, but God invites us to rest in His presence and to find our strength in Him. Quietness is not a sign of weakness; it's a sign of a woman who trusts in God's sovereignty. What is keeping you from a moment of quietness today? Take a moment to be still, to breathe, and to trust in God's power. Your strength is not found in your busyness, but in your quiet trust in Him.",
      "category": "strength",
      "topic": "quiet-strength",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-05-05": {
      "title": "A Mother's Love",
      "verse": "1 John 4:19 - We love because he first loved us.",
      "text": "Our capacity to love comes from God, who is the ultimate source of love. 1 John 4:19 says: 'We love because he first loved us.' This verse reminds us that our love is a reflection of God's love for us. As mothers, we are called to love our children with a love that mirrors the love of our heavenly Father. This kind of love is patient, kind, and unconditional. It's a love that is a source of security and acceptance for our children. How can you show your children the love of their heavenly Father today? Maybe it's by forgiving them when they make a mistake, by affirming their worth, or simply by giving them your undivided attention. A mother's love is a powerful testament to the love of God.",
      "category": "family",
      "topic": "motherhood-love",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1598453472093-2773c88e5d33?w=800"
    },
    "2025-05-06": {
      "title": "Living with Purpose",
      "verse": "Ephesians 2:10 - For we are his workmanship, created in Christ Jesus for good works, which God prepared beforehand, that we should walk in them.",
      "text": "Your life is not an accident; it is a work of art from God. Ephesians 2:10 tells us: 'For we are his workmanship, created in Christ Jesus for good works, which God prepared beforehand, that we should walk in them.' As women, we often measure our worth by our accomplishments, but our true worth is found in the purpose God has placed in our lives. Are you living with God's purpose today? Maybe it's through your work, your family, or your service in the church. Your life is a testimony of God's work in you, and through it, you can make an eternal difference. Live with the awareness that you are a work of God and that He has a purpose for every day of your life.",
      "category": "purpose",
      "topic": "purposeful-life",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    },
    "2025-05-07": {
      "title": "The Peace of Christ",
      "verse": "John 14:27 - Peace I leave with you; my peace I give to you. Not as the world gives do I give to you. Let not your hearts be troubled, neither let them be afraid.",
      "text": "The world offers a temporary sense of calm, but only Jesus offers true, lasting peace. John 14:27 says: 'Peace I leave with you; my peace I give to you. Not as the world gives do I give to you.' The peace of Christ is not the absence of conflict, but the presence of God in the midst of it. As women, we often face anxieties about our jobs, our families, or our futures. But Jesus invites us to cast those anxieties on Him and to receive His peace. This peace is a gift from the Holy Spirit that guards our hearts and our minds. Take a moment to pause, breathe, and pray. Give your worries to Him and trust that He will sustain you. His peace is a fortress for your soul.",
      "category": "emotions",
      "topic": "peace-in-trials",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1504938676239-e4d0f7f32997?w=800"
    },
    "2025-05-08": {
      "title": "A Life of Integrity",
      "verse": "Proverbs 11:3 - The integrity of the upright guides them, but the crookedness of the treacherous destroys them.",
      "text": "In a world where dishonesty often seems rewarded, a woman of God holds fast to integrity. Proverbs 11:3 assures us that 'The integrity of the upright guides them, but the crookedness of the treacherous destroys them.' Integrity isn't just the absence of lies; it's a consistency of character where your actions, words, and thoughts are aligned with God's truth. It is the foundation upon which a firm character is built. Is there an area in your life where you are tempted to take a shortcut or compromise your values? Today, choose the path of integrity, knowing that it is the path that will guide you and give you true peace. Integrity is a fortress that cannot be broken.",
      "category": "character",
      "topic": "integrity",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-05-09": {
      "title": "Trusting God’s Provision",
      "verse": "Matthew 6:31-33 - Therefore do not be anxious, saying, ‘What shall we eat?’ or ‘What shall we drink?’ or ‘What shall we wear?’ For the Gentiles seek after all these things, and your heavenly Father knows that you need them all. But seek first the kingdom of God and his righteousness, and all these things will be added to you.",
      "text": "Worrying about our needs is a common struggle, but God invites us to trust in His provision. Matthew 6:31-33 reminds us: 'But seek first the kingdom of God and his righteousness, and all these things will be added to you.' As women, we often feel the weight of providing for our families, but God assures us that He knows what we need. When we prioritize seeking Him, He promises to take care of everything else. What are you worried about today? Lay it at His feet and trust in His provision. He is a faithful Father who will never leave you nor forsake you.",
      "category": "faith",
      "topic": "trusting-provision",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    },
    "2025-05-10": {
      "title": "Leading with a Vision",
      "verse": "Proverbs 29:18 - Where there is no prophetic vision the people cast off restraint, but blessed is she who keeps the law.",
      "text": "Without a clear vision, life becomes a directionless wander. Proverbs 29:18 reminds us: 'Where there is no vision, the people perish.' Leadership is not just about the present, but about having a vision for the future. As women, we are called to be visionaries, to seek God's direction for our families, our careers, and our personal lives. This vision is not just for us; it is to guide those under our influence. What vision do you have for your family, your career, or your personal life this year? Take a moment to pray and ask God to give you a clear vision for the future. The vision of a faithful leader is a beacon of hope for those around her.",
      "category": "leadership",
      "topic": "vision",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1549494326-0e9e43685e13?w=800"
    },
    "2025-05-11": {
      "title": "A Mother's Influence",
      "verse": "Proverbs 31:26 - She opens her mouth with wisdom, and the teaching of kindness is on her tongue.",
      "text": "A mother's influence is a powerful force for good. Proverbs 31:26 describes a woman of virtue: 'She opens her mouth with wisdom, and the teaching of kindness is on her tongue.' As mothers, our words carry weight and our influence shapes our children's hearts. We are called to use our words to speak wisdom, kindness, and truth into their lives. What kind of influence are you having on your family today? Is your tongue a source of kindness and wisdom? Take a moment to pray for God to guard your mouth and to fill your words with His truth. A mother's influence is a lasting legacy that blesses generations.",
      "category": "family",
      "topic": "mother's-influence",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1598453472093-2773c88e5d33?w=800"
    },
    "2025-05-12": {
      "title": "Godly Strength",
      "verse": "Isaiah 40:29 - He gives power to the faint, and to him who has no might he increases strength.",
      "text": "When we feel weak and weary, God is our source of strength. Isaiah 40:29 promises: 'He gives power to the faint, and to him who has no might he increases strength.' The burdens of life can leave us feeling drained and exhausted, but God invites us to rely on Him for our strength. Our strength is not found in our own abilities, but in our relationship with Him. Where are you feeling weary today? Give that weariness to God and wait for Him to renew your strength. He will give you the power to soar above your circumstances and to face life with renewed hope. His strength is made perfect in our weakness.",
      "category": "strength",
      "topic": "godly-strength",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-05-13": {
      "title": "A Life of Prayer",
      "verse": "1 Thessalonians 5:17 - Pray without ceasing.",
      "text": "In a world of constant noise and distraction, a life of prayer is a radical act of faith. 1 Thessalonians 5:17 encourages us to 'pray without ceasing.' This is not a suggestion, but a command. Prayer is our direct line of communication with our heavenly Father. As women, we are often tempted to solve our problems on our own, but God invites us to bring all our worries and requests to Him. A life of prayer is a life of constant communion with God, where we are open to His will and His guidance. How can you pray without ceasing today? Maybe it's through short, intentional prayers throughout your day, or by setting aside a specific time to be with God. A woman who prays constantly is a woman who walks in the strength of God, not her own.",
      "category": "daily",
      "topic": "consistent-prayer",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1502691873133-72d8a55928d1?w=800"
    },
    "2025-05-14": {
      "title": "Joy in the Journey",
      "verse": "Nehemiah 8:10 - Then he said to them, “Go your way, eat the fat and drink sweet wine and send portions to anyone who has nothing ready, for this day is holy to our Lord. And do not be grieved, for the joy of the Lord is your strength.”",
      "text": "The joy of the Lord is not a fleeting feeling; it is a strength that sustains us in life. Nehemiah 8:10 reminds us: 'the joy of the Lord is your strength.' As women, we often feel like we have to be strong on our own. But the joy of the Lord is a supernatural strength that enables us to face life's challenges with a heavenly perspective. This joy is not based on our circumstances, but on our relationship with Him. What are you looking for to find joy today? Instead of seeking it in accomplishments or possessions, seek the joy of the Lord. Through prayer, worship, and gratitude, His joy will become your strength and give you the resilience to continue on your journey.",
      "category": "emotions",
      "topic": "joy",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1504938676239-e4d0f7f32997?w=800"
    },
    "2025-05-15": {
      "title": "A Life of Faithfulness",
      "verse": "1 Corinthians 4:2 - Moreover, it is required of stewards that they be found trustworthy.",
      "text": "Faithfulness is not just a belief; it is an action. 1 Corinthians 4:2 reminds us: 'Moreover, it is required of stewards that they be found trustworthy.' As women, we are stewards of the gifts and responsibilities God has given us. This includes our marriage, our children, our work, and our spiritual life. Faithfulness is demonstrated in the daily routine, in the small decisions, and in the acts of obedience. Where is God calling you to be faithful today? Maybe it's in a promise to your partner, in a task at work, or in a commitment to your church. Faithfulness in small things is a path to greater faithfulness. A faithful woman is a woman who glorifies God with her life.",
      "category": "character",
      "topic": "faithfulness",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-05-16": {
      "title": "Mother's Day",
      "verse": "Proverbs 31:28 - Her children rise up and call her blessed; her husband also, and he praises her.",
      "text": "Today, we celebrate mothers and the incredible gift they are to our lives. Proverbs 31:28 praises a virtuous woman: 'Her children rise up and call her blessed; her husband also, and he praises her.' A mother's love, sacrifice, and devotion are a reflection of God's heart. We are called to honor the mothers in our lives and to thank them for their unwavering love. If you are a mother, thank you for your commitment to your family and for being a vessel of God's love. If you are not a mother, take a moment to honor a woman who has been a mother figure to you. Today, let's celebrate the incredible women who have shaped our lives and pointed us to Christ. A mother's love is a legacy of faith.",
      "category": "family",
      "topic": "mother's-day",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1598453472093-2773c88e5d33?w=800"
    },
    "2025-05-17": {
      "title": "A Purposeful Work Life",
      "verse": "Colossians 3:23-24 - Whatever you do, work heartily, as for the Lord and not for men, knowing that from the Lord you will receive the inheritance as your reward. You are serving the Lord Christ.",
      "text": "Our work is not just a way to make a living; it's a way to worship God. Colossians 3:23-24 gives us a clear guide for our work life: 'Whatever you do, work heartily, as for the Lord and not for men... You are serving the Lord Christ.' This verse reminds us that our work, our goals, and our ambitions should be done for God's glory, not our own. As women, we are called to work with excellence, but our ultimate goal is to serve Christ. What is your ambition in life? Is it to gain wealth, power, or recognition? Or is it to serve the Lord with all your heart? A woman with godly ambition works for a greater reward than any the world can offer.",
      "category": "purpose",
      "topic": "purposeful-work",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    },
    "2025-05-18": {
      "title": "Overcoming with God's Word",
      "verse": "Psalm 119:105 - Your word is a lamp to my feet and a light to my path.",
      "text": "When we feel lost or uncertain, God's Word is our compass and our guide. Psalm 119:105 says: 'Your word is a lamp to my feet and a light to my path.' This verse reminds us that we don't have to navigate life's challenges in the dark. God's Word provides the clarity and direction we need to overcome obstacles and to walk in His will. As women, we are often tempted to rely on our own wisdom or the advice of the world. But the true source of wisdom and guidance is found in scripture. Are you facing a difficult decision or a challenging situation? Turn to God's Word for guidance. Read, meditate, and pray on His truth. His Word will light your path and give you the strength to overcome.",
      "category": "faith",
      "topic": "scripture-reading",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    },
    "2025-05-19": {
      "title": "The Courage to Lead",
      "verse": "Joshua 1:9 - Have I not commanded you? Be strong and courageous. Do not be frightened, and do not be dismayed, for the Lord your God is with you wherever you go.",
      "text": "True leadership requires courage. Joshua 1:9 gives us a powerful command and a promise: 'Be strong and courageous. Do not be frightened, and do not be dismayed, for the Lord your God is with you wherever you go.' As women, we are often faced with difficult decisions that require courage—decisions that can impact our family, our career, and our future. But this verse reminds us that we don't have to face these decisions alone. God is with us, and He gives us the strength to be courageous. What courageous decision are you being called to make today? Maybe it's a difficult conversation, a new career path, or a commitment to a new spiritual habit. Trust in the Lord, be strong and courageous, and He will guide you.",
      "category": "leadership",
      "topic": "courageous-decisions",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1549494326-0e9e43685e13?w=800"
    },
    "2025-05-20": {
      "title": "A Life of Humility",
      "verse": "Philippians 2:3-4 - Do nothing from selfish ambition or conceit, but in humility count others more significant than yourselves. Let each of you look not only to her own interests, but also to the interests of others.",
      "text": "Humility is not a weakness, but a strength that allows us to serve others. Philippians 2:3-4 challenges us to: 'Do nothing from selfish ambition or conceit, but in humility count others more significant than yourselves. Let each of you look not only to her own interests, but also to the interests of others.' As women, we often fall into the trap of ambition and pride. But the true leader is humble and seeks the good of others before herself. How can you show humility today? Maybe it's through an act of service, an attentive ear to a colleague, or a word of affirmation to your family. Humility in action is a testament to the leadership of Christ and a reflection of His heart. A humble woman is a woman who is strong in God.",
      "category": "character",
      "topic": "humility",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-05-21": {
      "title": "The Power of Forgiveness",
      "verse": "Colossians 3:13 - bearing with one another and, if one has a complaint against another, forgiving each other; as the Lord has forgiven you, so you also must forgive.",
      "text": "Forgiveness is a powerful act of love and a key to our emotional well-being. Colossians 3:13 reminds us: 'bearing with one another and, if one has a complaint against another, forgiving each other; as the Lord has forgiven you, so you also must forgive.' Holding on to resentment and bitterness is a heavy burden that can weigh us down. But when we forgive, we release ourselves from that burden and experience the peace that comes from a clean heart. Who do you need to forgive today? It may be a friend, a family member, or even yourself. Forgiveness is not about forgetting; it's about releasing the other person from the debt they owe you. Let go of the resentment and embrace the freedom of forgiveness. As the Lord has forgiven you, so you must also forgive.",
      "category": "emotions",
      "topic": "forgiveness",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1504938676239-e4d0f7f32997?w=800"
    },
    "2025-05-22": {
      "title": "A Consistent Walk with God",
      "verse": "Psalm 1:2-3 - but his delight is in the law of the Lord, and on his law he meditates day and night. He is like a tree planted by streams of water that yields its fruit in its season, and its leaf does not wither. In all that he does, he prospers.",
      "text": "The secret to a prosperous and fruitful life is a consistent walk with God. Psalm 1:2-3 describes a person who 'delights in the law of the Lord, and on his law she meditates day and night.' This is a woman who is rooted in God's Word, and as a result, she is like a tree planted by streams of water. Her life is fruitful, her leaf does not wither, and she prospers in all that she does. What are you meditating on today? Are you filling your mind with God's truth or with the noise of the world? A consistent walk with God is a path to a life of fruitfulness, peace, and prosperity. Let's make it our priority to be a woman rooted in His Word.",
      "category": "daily",
      "topic": "consistent-walk",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1502691873133-72d8a55928d1?w=800"
    },
    "2025-05-23": {
      "title": "Godly Strength in Trials",
      "verse": "James 1:2-4 - Count it all joy, my sisters, when you meet trials of various kinds, for you know that the testing of your faith produces steadfastness. And let steadfastness have its full effect, that you may be perfect and complete, lacking in nothing.",
      "text": "Trials are inevitable, but hope allows us to face them with joy. James 1:2-4 invites us to: 'Count it all joy, my sisters, when you meet trials of various kinds, for you know that the testing of your faith produces steadfastness.' This is a counter-cultural perspective. As women, we often want to avoid problems, but God uses difficult moments to forge our character and our faith. He molds us to be more like Christ. What trial are you facing right now? Instead of complaining, pray that God will give you the strength to persevere. The patience that is produced in the trial will make you a complete woman, lacking in nothing.",
      "category": "strength",
      "topic": "overcoming-trials",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-05-24": {
      "title": "A Life of Service",
      "verse": "Matthew 20:28 - just as the Son of Man did not come to be served, but to serve, and to give his life as a ransom for many.",
      "text": "The greatest example of leadership we have is Jesus, who 'did not come to be served, but to serve, and to give his life as a ransom for many.' As women, we are called to a life of service, to put the needs of others before our own. This is not a life of bondage, but a life of freedom, where we find our purpose in serving others. Who can you serve with a humble heart today? Maybe it's a family member, a coworker, or a neighbor in need. A life of service is a reflection of God's love and a powerful witness to the world. A woman who serves is a woman who is living out her purpose in Christ.",
      "category": "leadership",
      "topic": "servant-leadership",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1596205646193-4a16109961d3?w=800"
    },
    "2025-05-25": {
      "title": "A Heart of Humility",
      "verse": "Philippians 2:3 - Do nothing from selfish ambition or conceit, but in humility count others more significant than yourselves.",
      "text": "Pride and humility are two competing forces in our hearts. Philippians 2:3 challenges us to: 'Do nothing from selfish ambition or conceit, but in humility count others more significant than yourselves.' In a world that values self-promotion, God calls us to a life of humility, to put the needs of others before our own. A humble heart is a heart that is teachable, open to correction, and trusts in God's wisdom over her own. What is a source of pride in your life today? Take a moment to humble yourself before God and others. You will find that true peace and wisdom are found not in self-exaltation, but in a humble heart that trusts in the Lord.",
      "category": "character",
      "topic": "humility",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-05-26": {
      "title": "Living with an Eternal Perspective",
      "verse": "Colossians 3:1-2 - If then you have been raised with Christ, seek the things that are above, where Christ is, seated at the right hand of God. Set your minds on things that are above, not on things that are on earth.",
      "text": "The resurrection of Christ gives us a new perspective, one that goes beyond this life. Colossians 3:1-2 exhorts us to: 'If then you have been raised with Christ, seek the things that are above, where Christ is, seated at the right hand of God. Set your minds on things that are above, not on things that are on earth.' As women, we often get consumed by the worries and pleasures of this life. But God calls us to live with an eternal perspective, to seek the things that are above. Where are your eyes today? Are they on the things of this earth or on the things that are above? Live with the awareness that your true home is with Christ. A life lived with an eternal perspective is a life full of purpose and hope.",
      "category": "daily",
      "topic": "living-for-eternity",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1502691873133-72d8a55928d1?w=800"
    },
    "2025-05-27": {
      "title": "A Mother's Legacy of Faith",
      "verse": "2 Timothy 1:5 - I am reminded of your sincere faith, a faith that first dwelt in your grandmother Lois and your mother Eunice and now, I am sure, dwells in you as well.",
      "text": "A mother's legacy is not measured by her wealth or accomplishments, but by her faith. 2 Timothy 1:5 gives us a beautiful example of a legacy of faith: 'I am reminded of your sincere faith, a faith that first dwelt in your grandmother Lois and your mother Eunice and now, I am sure, dwells in you as well.' As mothers, we have the incredible privilege of passing on a legacy of faith to our children and grandchildren. This is done not just through our words, but through our example. Are you living a life of sincere faith that your children can see? Take a moment to pray for your children and for your legacy. A mother's legacy of faith is the greatest gift she can give to her family.",
      "category": "family",
      "topic": "legacy-of-faith",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1598453472093-2773c88e5d33?w=800"
    },
    "2025-05-28": {
      "title": "Strength to Endure",
      "verse": "Isaiah 40:31 - But they who wait for the Lord shall renew their strength; they shall mount up with wings like eagles; they shall run and not be weary; they shall walk and not faint.",
      "text": "When our strength runs out, hope in God gives us new wings. Isaiah 40:31 reminds us: 'But they who wait for the Lord shall renew their strength; they shall mount up with wings like eagles; they shall run and not be weary; they shall walk and not faint.' This verse is a powerful promise for the woman who feels weary and worn out. Our strength does not come from our own efforts, but from waiting on the Lord. 'Waiting' on the Lord is not passive; it's an active reliance on Him through prayer, worship, and the reading of His Word. What burdens are weighing you down today? Give them to God and wait for Him to renew your strength. He will give you the power to soar above your circumstances.",
      "category": "strength",
      "topic": "strength-to-endure",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-05-29": {
      "title": "A Life of Trust",
      "verse": "Proverbs 3:5-6 - Trust in the Lord with all your heart, and do not lean on your own understanding. In all your ways acknowledge him, and he will make straight your paths.",
      "text": "In a world of uncertainty, the only certainty we have is that we can trust in God. Proverbs 3:5-6 exhorts us to: 'Trust in the Lord with all your heart, and do not lean on your own understanding. In all your ways acknowledge him, and he will make straight your paths.' As women, we often rely on our own understanding and our ability to solve problems. But God invites us to a radical trust in Him. This doesn't mean we shouldn't plan, but that we should submit our plans to His will. What area of your life do you find it difficult to surrender to God? Maybe it's your career, your marriage, or a future decision. Acknowledge Him in all your ways and trust that He will make your paths straight for your good and for His glory.",
      "category": "faith",
      "topic": "trust",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    },
    "2025-05-30": {
      "title": "A Life of Gratitude and Praise",
      "verse": "1 Thessalonians 5:18 - give thanks in all circumstances; for this is the will of God in Christ Jesus for you.",
      "text": "A grateful heart is a joyful heart. 1 Thessalonians 5:18 reminds us to 'give thanks in all circumstances; for this is the will of God in Christ Jesus for you.' This is not a suggestion; it's a command. Gratitude is a powerful spiritual discipline that transforms our perspective and fills us with joy, even in difficult times. It's a way of acknowledging God's sovereignty and His goodness in every situation. What are you grateful for today? Take a moment to praise God for His faithfulness and for His love. A life of gratitude and praise is a life that truly honors God.",
      "category": "daily",
      "topic": "gratitude",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1502691873133-72d8a55928d1?w=800"
    },
    "2025-05-31": {
      "title": "A Life of Peace",
      "verse": "Philippians 4:6-7 - Do not be anxious about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God. And the peace of God, which surpasses all understanding, will guard your hearts and your minds in Christ Jesus.",
      "text": "Anxiety is a common struggle for us, but God's peace is our refuge. Philippians 4:6-7 gives us a powerful solution: 'Do not be anxious about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God. And the peace of God, which surpasses all understanding, will guard your hearts and your minds in Christ Jesus.' This is not a suggestion, but a command to release our anxieties to God through prayer. The peace of God is a supernatural gift that guards our hearts and minds from the attacks of the enemy. What is causing you anxiety today? Bring it to God in prayer with a heart of thanksgiving. Trust that His peace will guard you and give you rest. His peace is a fortress for your soul.",
      "category": "emotions",
      "topic": "peace",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1504938676239-e4d0f7f32997?w=800"
    }
  },
  "meta": {
    "month": "2025-05",
    "totalDevotionals": 31,
    "premiumCount": 0,
    "freeCount": 31,
    "description": "Daily devotionals for Christian women - May 2025"
  }
}
