{
  "devotionals": {
    "2025-06-01": {
      "title": "A Heart of Humility",
      "verse": "1 Peter 5:6-7 - Humble yourselves, therefore, under the mighty hand of God so that at the proper time he may exalt you, casting all your anxieties on him, because he cares for you.",
      "text": "The world often teaches us to be proud and self-sufficient, but God calls us to a different path: one of humility. 1 Peter 5:6-7 encourages us to 'humble yourselves, therefore, under the mighty hand of God.' Humility isn't a weakness; it's a profound act of trust in God's sovereignty. When we humble ourselves, we admit that we aren't in control, and we give God the space to work in our lives. What anxieties are you holding onto today? Lay them at His feet, knowing that He cares for you. True strength is found not in our own efforts, but in humbly casting our cares on the Lord.",
      "category": "daily",
      "topic": "humility",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-06-02": {
      "title": "Leading with a Servant's Heart",
      "verse": "Matthew 20:28 - ...just as the Son of Man did not come to be served, but to serve, and to give his life as a ransom for many.",
      "text": "True leadership isn't about power or position; it's about service. Jesus, our ultimate example, 'did not come to be served, but to serve.' As leaders, whether at home, in the workplace, or in our communities, we're called to reflect this same heart. We lead by lifting others up, not by demanding they lift us. What small act of service can you do today to bless someone under your influence? Maybe it's listening to a coworker with full attention, doing a chore for a family member without being asked, or simply offering a helping hand to a friend in need. Leading with a servant's heart is a beautiful way to live out our faith.",
      "category": "leadership",
      "topic": "servant-leadership",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1596205646193-4a16109961d3?w=800"
    },
    "2025-06-03": {
      "title": "Faithfulness in the Little Things",
      "verse": "Luke 16:10 - One who is faithful in a very little is also faithful in much, and one who is dishonest in a very little is also dishonest in much.",
      "text": "Faithfulness isn't just about grand gestures; it’s built in the small, everyday moments. Luke 16:10 reminds us that being 'faithful in a very little is also faithful in much.' As we go about our daily lives, God is watching how we handle the small tasks and responsibilities He has given us. Are you a woman who keeps her promises, even the small ones? Are you trustworthy with your time, your words, and your resources? Today, let's commit to being faithful in the little things. This is how we build a life of integrity and prove ourselves ready for the greater things God has in store for us.",
      "category": "character",
      "topic": "faithfulness",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-06-04": {
      "title": "A Life of Purpose",
      "verse": "Jeremiah 29:11 - 'For I know the plans I have for you,' declares the Lord, 'plans for welfare and not for evil, to give you a future and a hope.'",
      "text": "Our lives are not random; they are intentional. Jeremiah 29:11 reassures us that God has beautiful plans for us, 'plans for welfare and not for evil, to give you a future and a hope.' This means we can live with a sense of purpose and direction, knowing that every part of our journey—the ups and the downs—is held in His hands. Are you feeling lost or uncertain about your path right now? Don't lose heart. Take a moment to pray and trust in God's plans. Your purpose isn't something you have to figure out all at once; it's a beautiful path that unfolds with each step you take in faith.",
      "category": "purpose",
      "topic": "life-purpose",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    },
    "2025-06-05": {
      "title": "The Peace That Keeps Us",
      "verse": "Philippians 4:7 - And the peace of God, which surpasses all understanding, will guard your hearts and your minds in Christ Jesus.",
      "text": "Anxiety can feel so overwhelming, can't it? But God offers us a different way. Philippians 4:7 promises that 'the peace of God, which surpasses all understanding, will guard your hearts and your minds.' This isn't a peace that comes from a perfect life; it's a supernatural peace that holds us steady even in the midst of chaos. What worries are you carrying today? Instead of letting them consume you, take a moment to pray and release them to God. His peace is like a fortress around your heart and mind, protecting you from fear and doubt. You don't have to carry your burdens alone; He is here to give you rest.",
      "category": "emotions",
      "topic": "peace-in-anxiety",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1504938676239-e4d0f7f32997?w=800"
    },
    "2025-06-06": {
      "title": "A Mother's Devotion",
      "verse": "Proverbs 31:28 - Her children rise up and call her blessed; her husband also, and he praises her.",
      "text": "A mother's devotion to her family is a beautiful and tireless act of love. Proverbs 31:28 paints a picture of a woman whose children 'rise up and call her blessed.' This isn't about being perfect; it's about being present, loving, and intentional. A devoted mother teaches, nurtures, and prays for her children, shaping their hearts and their futures. What small act of devotion can you show your children today? Maybe it's a special story at bedtime, a heartfelt note in their lunchbox, or simply stopping to give them a hug and listen to their day. Your devotion is a powerful legacy of faith and love.",
      "category": "family",
      "topic": "mother's-devotion",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1598453472093-2773c88e5d33?w=800"
    },
    "2025-06-07": {
      "title": "The Power of a Gentle Spirit",
      "verse": "Proverbs 15:1 - A gentle answer turns away wrath, but a harsh word stirs up anger.",
      "text": "We often think of strength as being bold and forceful, but God's Word shows us a different kind of power: the power of a gentle spirit. Proverbs 15:1 tells us that 'a gentle answer turns away wrath.' As women, our words have incredible power to either bring peace or stir up conflict. A gentle answer, rooted in the Holy Spirit, is a sign of wisdom and self-control. It can de-escalate a tense situation and bring harmony to our relationships. Where do you need to be more gentle with your words today? Take a moment to pray for a gentle spirit, so that your words can be a source of life and peace to those around you.",
      "category": "character",
      "topic": "gentleness",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-06-08": {
      "title": "Strength in the Struggle",
      "verse": "Isaiah 41:10 - Fear not, for I am with you; be not dismayed, for I am your God; I will strengthen you, I will help you, I will uphold you with my righteous right hand.",
      "text": "When life feels overwhelming, this beautiful promise from Isaiah 41:10 is a lifeline: 'Fear not, for I am with you...I will strengthen you, I will help you, I will uphold you.' God knows our struggles and our fears, and He promises to be right there with us. Our strength doesn't come from a lack of trials, but from His presence in the midst of them. He will give you the power you need to face whatever challenge comes your way. What are you afraid of today? Give that fear to God, and trust in His promise to strengthen and uphold you. His hand is always there to catch you.",
      "category": "strength",
      "topic": "strength-in-the-struggle",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-06-09": {
      "title": "Our True Identity in Christ",
      "verse": "2 Corinthians 5:17 - Therefore, if anyone is in Christ, she is a new creation. The old has passed away; behold, the new has come.",
      "text": "Have you ever felt defined by your past? By your mistakes, your failures, or the labels others have given you? If so, this verse is a beautiful reminder of who you truly are in Christ. In Him, you are a 'new creation.' The old has passed away—it no longer defines you. God has given you a fresh start, a clean slate. Today, let's step into this new identity. Don't let the lies of the enemy or the ghosts of your past hold you back. You are a daughter of the King, redeemed and made new. Live with the confidence and freedom of your new identity.",
      "category": "daily",
      "topic": "identity-in-christ",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1502691873133-72d8a55928d1?w=800"
    },
    "2025-06-10": {
      "title": "Leading with Integrity",
      "verse": "Proverbs 11:3 - The integrity of the upright guides them, but the crookedness of the treacherous destroys them.",
      "text": "True leadership is built on a foundation of integrity. Proverbs 11:3 assures us that 'the integrity of the upright guides them.' In a world that often rewards dishonesty, a woman of God is called to live with unwavering integrity. This means being honest in our words and actions, even when it's difficult. It's about doing the right thing, even when no one is watching. Your integrity is your greatest asset as a leader. It builds trust, inspires confidence, and sets a powerful example for your family and those you influence. Today, choose the path of integrity. It's the path to true guidance and lasting peace.",
      "category": "leadership",
      "topic": "integrity",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-06-11": {
      "title": "The Purpose of Rest",
      "verse": "Matthew 11:28 - Come to me, all who labor and are heavy laden, and I will give you rest.",
      "text": "In our fast-paced culture, we're often celebrated for our busyness. But Jesus gives us a beautiful invitation: 'Come to me, all who labor and are heavy laden, and I will give you rest.' Rest isn't a sign of weakness; it's a spiritual discipline. It's an act of trusting that God is in control and that we don't have to carry the weight of the world on our shoulders. What is weighing you down today? Maybe it's a to-do list that feels endless or an emotional burden that is exhausting you. Take a moment to come to Jesus and lay it all at His feet. He promises to give you the rest your soul longs for.",
      "category": "purpose",
      "topic": "rest",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1504938676239-e4d0f7f32997?w=800"
    },
    "2025-06-12": {
      "title": "A Mother's Wisdom",
      "verse": "Proverbs 31:26 - She opens her mouth with wisdom, and the teaching of kindness is on her tongue.",
      "text": "A mother's wisdom is a precious gift. Proverbs 31:26 beautifully describes a virtuous woman: 'She opens her mouth with wisdom, and the teaching of kindness is on her tongue.' As mothers, our words have incredible power to build up or tear down. We are called to use our voices to speak life, to share wisdom, and to teach kindness. What wisdom is God giving you today? How can you use your words to bless your family? Take a moment to pray for God to fill your heart with His wisdom so that your words can be a source of strength, comfort, and guidance to those you love. A mother's wisdom is a legacy of love.",
      "category": "family",
      "topic": "mother's-wisdom",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1598453472093-2773c88e5d33?w=800"
    },
    "2025-06-13": {
      "title": "Strength to Endure",
      "verse": "Hebrews 12:1-2 - ...let us also lay aside every weight, and sin which clings so closely, and let us run with endurance the race that is set before us, looking to Jesus, the founder and perfecter of our faith...",
      "text": "Life can feel like a marathon, full of unexpected challenges and obstacles. But Hebrews 12:1-2 gives us a powerful guide for this race: 'run with endurance...looking to Jesus.' Perseverance is not a weakness; it's a testament to our faith. When we feel tired or discouraged, we can fix our eyes on Jesus, who is the ultimate example of endurance. He ran the race for us, and He gives us the strength to run ours. What is weighing you down today? Lay it aside and fix your eyes on Him. He is running with you, and He will see you through to the finish line.",
      "category": "strength",
      "topic": "endurance",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-06-14": {
      "title": "A Heart of Gratitude",
      "verse": "Psalm 100:4 - Enter his gates with thanksgiving and his courts with praise; give thanks to him and praise his name.",
      "text": "Gratitude is a powerful spiritual discipline that transforms our perspective. Psalm 100:4 invites us to 'enter his gates with thanksgiving and his courts with praise.' When we choose to be grateful, we shift our focus from our problems to God's promises. What are you grateful for today? Even in the midst of a difficult situation, there is always something to be thankful for. Take a moment to thank God for His faithfulness, His love, and His grace. A heart of gratitude is a beautiful act of worship that honors God and fills our souls with joy.",
      "category": "daily",
      "topic": "gratitude",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1502691873133-72d8a55928d1?w=800"
    },
    "2025-06-15": {
      "title": "A Life of Faith",
      "verse": "Hebrews 11:1 - Now faith is the assurance of things hoped for, the conviction of things not seen.",
      "text": "Faith isn't a feeling; it's a deep conviction. Hebrews 11:1 beautifully defines faith as 'the assurance of things hoped for, the conviction of things not seen.' As women, we often want to see the path before we take the first step, but God calls us to live by faith, not by sight. This is a radical act of trust that honors God and opens the door for His power to work in our lives. What are you hoping for today? Take a moment to pray and lay your hopes at His feet. Trust that He is working behind the scenes, even when you can't see it. A life of faith is a life that is full of purpose and hope.",
      "category": "faith",
      "topic": "faith",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    },
    "2025-06-16": {
      "title": "The Purpose of Our Influence",
      "verse": "Matthew 5:16 - In the same way, let your light shine before others, so that they may see your good works and give glory to your Father who is in heaven.",
      "text": "As women, we have a beautiful opportunity to be a light in a dark world. Matthew 5:16 reminds us to 'let your light shine before others, so that they may see your good works and give glory to your Father who is in heaven.' Our influence isn't for our own glory, but to point others to Christ. This isn't about being perfect; it's about living an authentic life of faith, kindness, and integrity that others can see. What small way can you be a light today? Maybe it's a kind word to a coworker, a selfless act for a stranger, or a prayer for a friend. Your life is a living testimony of God's love, and through it, you can make a powerful difference.",
      "category": "purpose",
      "topic": "influence",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    },
    "2025-06-17": {
      "title": "A Mother's Legacy",
      "verse": "2 Timothy 1:5 - I am reminded of your sincere faith, a faith that first dwelt in your grandmother Lois and your mother Eunice and now, I am sure, dwells in you as well.",
      "text": "A mother's legacy is not measured by her wealth or accomplishments, but by her faith. 2 Timothy 1:5 gives us a beautiful example of a legacy of faith: 'I am reminded of your sincere faith, a faith that first dwelt in your grandmother Lois and your mother Eunice.' As mothers, we have the incredible privilege of passing on a legacy of faith to our children and grandchildren. This is done not just through our words, but through our example. Are you living a life of sincere faith that your children can see? Take a moment to pray for your children and for your legacy. A mother's legacy of faith is the greatest gift she can give to her family.",
      "category": "family",
      "topic": "legacy-of-faith",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1598453472093-2773c88e5d33?w=800"
    },
    "2025-06-18": {
      "title": "The Power of Forgiveness",
      "verse": "Colossians 3:13 - bearing with one another and, if one has a complaint against another, forgiving each other; as the Lord has forgiven you, so you also must forgive.",
      "text": "Holding on to unforgiveness is like carrying a heavy weight. Colossians 3:13 reminds us to 'forgive each other; as the Lord has forgiven you, so you also must forgive.' Forgiveness isn't about condoning what was done to us; it's about releasing the other person—and ourselves—from the burden of resentment. It's a beautiful act of obedience to God. Who do you need to forgive today? Take a moment to pray for that person and release them to God. You will find that when you forgive, you also experience a new level of peace and freedom in your own life.",
      "category": "emotions",
      "topic": "forgiveness",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1504938676239-e4d0f7f32997?w=800"
    },
    "2025-06-19": {
      "title": "Strength to Overcome",
      "verse": "Philippians 4:13 - I can do all things through him who strengthens me.",
      "text": "Life can present challenges that feel impossible to overcome. But Philippians 4:13 gives us a powerful truth to hold on to: 'I can do all things through him who strengthens me.' This is not a promise of an easy life, but a guarantee of supernatural strength. The 'all things' here refers to the ability to endure, to overcome, and to find peace in the midst of adversity. Your strength doesn't come from your own will or determination; it comes from Christ who lives in you. What mountain are you facing today? Don't face it alone. Ask God for the strength to climb it, knowing that His power is made perfect in your weakness. Your strength is not a sign of your ability, but a testament to His faithfulness.",
      "category": "strength",
      "topic": "overcoming",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-06-20": {
      "title": "The Wisdom to Lead",
      "verse": "James 1:5 - If any of you lacks wisdom, let her ask God, who gives generously to all without reproach, and it will be given her.",
      "text": "As leaders, we often face complex decisions that require wisdom beyond our own understanding. But James 1:5 gives us a beautiful solution: 'If any of you lacks wisdom, let her ask God, who gives generously.' This is a powerful promise for a woman who is in a leadership position, whether at work, at home, or in her community. We don't have to have all the answers. God invites us to come to Him and ask for wisdom, and He promises to give it to us generously. What difficult decision are you facing today? Take a moment to pause and ask God for wisdom. He is faithful to guide you and to give you the clarity you need to lead with confidence.",
      "category": "leadership",
      "topic": "wisdom",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1549494326-0e9e43685e13?w=800"
    },
    "2025-06-21": {
      "title": "A Disciplined Spirit",
      "verse": "1 Timothy 4:7-8 - Rather train yourself for godliness; for while bodily training is of some value, godliness is of value in every way, as it holds promise for the present life and also for the life to come.",
      "text": "Discipline isn't a burden; it's a beautiful way to grow in godliness. 1 Timothy 4:7-8 urges us to 'train yourself for godliness.' Just as an athlete trains her body, a woman of faith trains her soul through spiritual disciplines like prayer, scripture reading, and worship. These habits are not about earning God's love, but about creating space for Him to transform us. What spiritual discipline can you practice today to get closer to God? Maybe it's a few extra minutes in prayer, or reading a chapter of the Bible. Consistent spiritual discipline is the key to a strong and vibrant faith.",
      "category": "daily",
      "topic": "discipline",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1502691873133-72d8a55928d1?w=800"
    },
    "2025-06-22": {
      "title": "God’s Unconditional Love",
      "verse": "Romans 8:38-39 - For I am sure that neither death nor life, nor angels nor rulers, nor things present nor things to come, nor powers, nor height nor depth, nor anything else in all creation, will be able to separate us from the love of God in Christ Jesus our Lord.",
      "text": "There is nothing in this world that can separate us from God's love. Romans 8:38-39 gives us a powerful and beautiful promise: 'For I am sure that neither death nor life... nor anything else in all creation, will be able to separate us from the love of God in Christ Jesus our Lord.' This is a love that is unconditional, unwavering, and eternal. When we feel like we've failed or fallen short, we can rest in the truth that His love for us never changes. Take a moment to pray and thank God for His incredible, unconditional love. His love is a firm foundation for our lives and a source of strength in every season.",
      "category": "faith",
      "topic": "god's-love",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    },
    "2025-06-23": {
      "title": "A Life of Kindness",
      "verse": "Ephesians 4:32 - Be kind to one another, tenderhearted, forgiving one another, as God in Christ forgave you.",
      "text": "Kindness is a beautiful reflection of God's love in our lives. Ephesians 4:32 reminds us to 'be kind to one another, tenderhearted, forgiving one another, as God in Christ forgave you.' As women, we are called to be a source of kindness and grace in our homes, our workplaces, and our communities. What small act of kindness can you do today? Maybe it's a word of encouragement to a friend, a helping hand to a stranger, or a moment of grace to a family member. Kindness is not just a personality trait; it's a powerful way to live out our faith and to show others the love of Christ.",
      "category": "character",
      "topic": "kindness",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-06-24": {
      "title": "Trusting in His Purpose",
      "verse": "Proverbs 3:5-6 - Trust in the Lord with all your heart, and do not lean on your own understanding. In all your ways acknowledge him, and he will make straight your paths.",
      "text": "Our lives can be full of twists and turns, but we can trust that God is guiding us. Proverbs 3:5-6 encourages us to 'trust in the Lord with all your heart, and do not lean on your own understanding.' This is a beautiful invitation to surrender our plans and our worries to God. He has a perfect plan for us, and He promises to make our paths straight. What are you trying to control or figure out on your own today? Lay it at His feet, and trust that He is working everything out for your good and for His glory. A life of trust is a life of peace and purpose.",
      "category": "purpose",
      "topic": "trusting-god",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    },
    "2025-06-25": {
      "title": "A Heart of Peace",
      "verse": "John 14:27 - Peace I leave with you; my peace I give to you. Not as the world gives do I give to you. Let not your hearts be troubled, neither let them be afraid.",
      "text": "The world's peace is conditional, but the peace of Christ is a beautiful and constant gift. John 14:27 tells us: 'Peace I leave with you; my peace I give to you.' This isn't a peace that comes from the absence of problems, but a peace that comes from the presence of God in the midst of them. What is troubling your heart today? Give that worry to God and receive His peace. His peace is a fortress around your heart and mind, guarding you from fear and anxiety. You don't have to carry your burdens alone; He is here to give you rest.",
      "category": "emotions",
      "topic": "peace-of-christ",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1504938676239-e4d0f7f32997?w=800"
    },
    "2025-06-26": {
      "title": "Building a Legacy of Faith",
      "verse": "Psalm 78:4 - We will not hide them from their children, but tell to the coming generation the glorious deeds of the Lord, and his might, and the wonders that he has done.",
      "text": "Our stories of faith are not just for us; they are for the next generation. Psalm 78:4 reminds us to 'tell to the coming generation the glorious deeds of the Lord.' As women, we have a unique opportunity to build a legacy of faith in our families by sharing our stories of God's goodness and faithfulness. What is a story of God's faithfulness in your life that you can share with your children today? Maybe it's a time He provided for you, a time He gave you strength in a difficult situation, or a time He answered a prayer. Your story is a powerful tool to build a legacy of faith that will last for generations.",
      "category": "family",
      "topic": "legacy",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1598453472093-2773c88e5d33?w=800"
    },
    "2025-06-27": {
      "title": "Courage in Christ",
      "verse": "Joshua 1:9 - Have I not commanded you? Be strong and courageous. Do not be frightened, and do not be dismayed, for the Lord your God is with you wherever you go.",
      "text": "Courage isn't the absence of fear; it's the decision to act in spite of it. Joshua 1:9 gives us a powerful command and a promise: 'Be strong and courageous. Do not be frightened, and do not be dismayed, for the Lord your God is with you wherever you go.' What brave decision are you avoiding today? Maybe it's a difficult conversation, a new career path, or a commitment to a new spiritual habit. Don't let fear hold you back. Trust in the Lord, be strong and courageous, and He will guide you. Your courage is a testament to your faith in His faithfulness.",
      "category": "strength",
      "topic": "courage",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-06-28": {
      "title": "A Life of Humility",
      "verse": "Philippians 2:3 - Do nothing from selfish ambition or conceit, but in humility count others more significant than yourselves.",
      "text": "Humility is a beautiful and powerful virtue. Philippians 2:3 challenges us to 'count others more significant than yourselves.' In a world that values self-promotion and ambition, God calls us to a different path: one of humility and service. A humble woman is a woman who is secure in her identity in Christ, and as a result, she can lift others up without feeling threatened. Who can you lift up and encourage today? Maybe it's a friend, a family member, or a coworker. A life of humility is a life that is full of purpose and peace. It's a beautiful way to live out our faith.",
      "category": "character",
      "topic": "humility",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1614216390145-236b80155b9e?w=800"
    },
    "2025-06-29": {
      "title": "Living with an Eternal Perspective",
      "verse": "Colossians 3:1-2 - If then you have been raised with Christ, seek the things that are above, where Christ is, seated at the right hand of God. Set your minds on things that are above, not on things that are on earth.",
      "text": "The resurrection of Christ gives us a new perspective, one that goes beyond this life. Colossians 3:1-2 exhorts us to: 'If then you have been raised with Christ, seek the things that are above... Set your minds on things that are above, not on things that are on earth.' As we go about our daily lives, it's easy to get caught up in the worries and pleasures of this world. But God calls us to live with an eternal perspective. What are you focused on today? Is it bringing you closer to God and His purpose for your life? Take a moment to lift your eyes to heaven and set your mind on the things that are above. A life lived with an eternal perspective is a life full of purpose and hope.",
      "category": "daily",
      "topic": "living-for-eternity",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1502691873133-72d8a55928d1?w=800"
    },
    "2025-06-30": {
      "title": "A Life of Trust",
      "verse": "Proverbs 3:5-6 - Trust in the Lord with all your heart, and do not lean on your own understanding. In all your ways acknowledge him, and he will make straight your paths.",
      "text": "As we close out the month, let's remember to trust in God's perfect plan for us. Proverbs 3:5-6 encourages us to 'trust in the Lord with all your heart, and do not lean on your own understanding.' This is a beautiful invitation to surrender our plans and our worries to God. He is faithful to guide us and to make our paths straight. What are you trying to control or figure out on your own today? Lay it at His feet, and trust that He is working everything out for your good and for His glory. A life of trust is a life of peace and purpose.",
      "category": "faith",
      "topic": "trusting-god",
      "isPremium": false,
      "image": "https://images.unsplash.com/photo-1610486676332-9027878344e2?w=800"
    }
  },
  "meta": {
    "month": "2025-06",
    "totalDevotionals": 30,
    "premiumCount": 0,
    "freeCount": 30,
    "description": "Daily devotionals for Christian women - June 2025"
  }
}
